<a href="https://colab.research.google.com/github/hwon-n/examples/blob/master/pandas_example.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandas 함수 제대로 알기

## count() vs size()

count는 df에 바로 사용해도 되지만 size는 df에 바로 사용할 수 없음. size 함수는 Series의 행 개수를 세기 때문에 Series 타입에 사용해줘야함. (ex. groupby로 df를 그룹화 한 뒤 size() 메소드 실행)

In [51]:
import pandas as pd

data = [['Apple', 5, 'Medium'], ['Banana', 6, 'Large'], ['Pineapple', 8, 'Small'], [None, 7, 'Large'], ['Apple', 7, 'Medium'], ['Mango', 10, 'Small'], 
        ['Peach', 9, 'Lage'], ['Cherry', 10, 'Medium'], ['Cherry', 7, 'Small'], ['Watermelon', 12, 'Medium'], ['Apple', 10, 'Large'], [None, 12, None],
        ['kiwi', 8, 'Medium'], ['kiwi', 9, 'Medium'], ['kiwi', 6, 'Small'], ['Melon', 10, 'Small'], ['strawberry', 6, 'Large']]

df = pd.DataFrame(data, columns = ['Fruit', 'Price', 'Size'])

df

         Fruit  Price    Size
0        Apple      5  Medium
1       Banana      6   Large
2    Pineapple      8   Small
3         None      7   Large
4        Apple      7  Medium
5        Mango     10   Small
6        Peach      9    Lage
7       Cherry     10  Medium
8       Cherry      7   Small
9   Watermelon     12  Medium
10       Apple     10   Large
11        None     12    None
12        kiwi      8  Medium
13        kiwi      9  Medium
14        kiwi      6   Small
15       Melon     10   Small
16  strawberry      6   Large

In [52]:
df.count()

Fruit    15
Price    17
Size     16
dtype: int64

In [53]:
df.groupby('Fruit').size()

Fruit
Apple         3
Banana        1
Cherry        2
Mango         1
Melon         1
Peach         1
Pineapple     1
Watermelon    1
kiwi          3
strawberry    1
dtype: int64

mode()와 value_counts(), sort_value

In [54]:
df.mode()

   Fruit  Price    Size
0  Apple   10.0  Medium
1   kiwi    NaN     NaN

In [55]:
df.value_counts()

Fruit       Price  Size
strawberry  6      Large     1
kiwi        9      Medium    1
            8      Medium    1
            6      Small     1
Watermelon  12     Medium    1
Pineapple   8      Small     1
Peach       9      Lage      1
Melon       10     Small     1
Mango       10     Small     1
Cherry      10     Medium    1
            7      Small     1
Banana      6      Large     1
Apple       10     Large     1
            7      Medium    1
            5      Medium    1
dtype: int64

In [56]:
df.sort_values(by = 'Price')

         Fruit  Price    Size
0        Apple      5  Medium
14        kiwi      6   Small
16  strawberry      6   Large
1       Banana      6   Large
3         None      7   Large
4        Apple      7  Medium
8       Cherry      7   Small
12        kiwi      8  Medium
2    Pineapple      8   Small
6        Peach      9    Lage
13        kiwi      9  Medium
5        Mango     10   Small
7       Cherry     10  Medium
15       Melon     10   Small
10       Apple     10   Large
9   Watermelon     12  Medium
11        None     12    None

In [57]:
df.sort_values(by = 'Price', ascending = False)

         Fruit  Price    Size
9   Watermelon     12  Medium
11        None     12    None
5        Mango     10   Small
7       Cherry     10  Medium
15       Melon     10   Small
10       Apple     10   Large
6        Peach      9    Lage
13        kiwi      9  Medium
2    Pineapple      8   Small
12        kiwi      8  Medium
8       Cherry      7   Small
3         None      7   Large
4        Apple      7  Medium
14        kiwi      6   Small
16  strawberry      6   Large
1       Banana      6   Large
0        Apple      5  Medium

groupby() 활용하기

In [58]:
df.groupby('Fruit').sum()

            Price
Fruit
Apple          22
Banana          6
Cherry         17
Mango          10
Melon          10
Peach           9
Pineapple       8
Watermelon     12
kiwi           23
strawberry      6

In [59]:
df.groupby(['Fruit', 'Size']).sum()

                   Price
Fruit      Size
Apple      Large      10
           Medium     12
Banana     Large       6
Cherry     Medium     10
           Small       7
Mango      Small      10
Melon      Small      10
Peach      Lage        9
Pineapple  Small       8
Watermelon Medium     12
kiwi       Medium     17
           Small       6
strawberry Large       6

In [60]:
df.groupby('Size').agg(['sum', 'mean'])

       Price
         sum  mean
Size
Lage       9  9.00
Large     29  7.25
Medium    51  8.50
Small     41  8.20

merge()와 join()

In [61]:
data2 = [['Lemon', 'Medium'], ['Apple', 'Small'], ['Pear', 'Large'], ['Pineapple', 'Large']]

df2 = pd.DataFrame(data2, columns = ['Fruit', 'Size'])
df2

       Fruit    Size
0      Lemon  Medium
1      Apple   Small
2       Pear   Large
3  Pineapple   Large

In [64]:
new_df = pd.merge(df, df2, how = 'left')

new_df

         Fruit  Price    Size
0        Apple      5  Medium
1       Banana      6   Large
2    Pineapple      8   Small
3         None      7   Large
4        Apple      7  Medium
5        Mango     10   Small
6        Peach      9    Lage
7       Cherry     10  Medium
8       Cherry      7   Small
9   Watermelon     12  Medium
10       Apple     10   Large
11        None     12    None
12        kiwi      8  Medium
13        kiwi      9  Medium
14        kiwi      6   Small
15       Melon     10   Small
16  strawberry      6   Large

In [67]:
new_df2 = pd.merge(df, df2, how = 'right')

new_df2

       Fruit  Price    Size
0      Lemon    NaN  Medium
1      Apple    NaN   Small
2       Pear    NaN   Large
3  Pineapple    NaN   Large

reset_index와 set_index

In [72]:
# df.set_index('Size', inplace = True)

df.reset_index()

      Size       Fruit  Price
0   Medium       Apple      5
1    Large      Banana      6
2    Small   Pineapple      8
3    Large        None      7
4   Medium       Apple      7
5    Small       Mango     10
6     Lage       Peach      9
7   Medium      Cherry     10
8    Small      Cherry      7
9   Medium  Watermelon     12
10   Large       Apple     10
11    None        None     12
12  Medium        kiwi      8
13  Medium        kiwi      9
14   Small        kiwi      6
15   Small       Melon     10
16   Large  strawberry      6

isin()
=> 어떤 list에 존재하는 요소가 DataFrame 혹은 Series에 존재하는지를 반환해줌

In [73]:
a = ['Apple', 'Blueberry']

df[df['Fruit'].isin(a)]

        Fruit  Price
Size
Medium  Apple      5
Medium  Apple      7
Large   Apple     10